# Homebrew stuff
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "mas"

# Core utility stuff
brew "curl"
brew "git"
brew "jq"
brew "nano"
brew "unzip"
brew "zsh"

# Database(ish) stuff
brew "mysql", restart_service: true
brew "redis", restart_service: true

# Virtual environment stuff
cask "docker"

# Ruby stuff
brew "rbenv"

# WordPress stuff
tap "dxw/tap"
brew "composer"
brew "dxw/tap/whippet"

# Scripting stuff
brew "shellcheck"

# JS stuff
brew "nodenv"
brew "yarn"

# Python stuff
brew "poetry"

# Infrastructure stuff
tap "heroku/brew"
brew "tfenv"
brew "tflint"
brew "heroku/brew/heroku"
brew "awscli"

# Documentation stuff
brew "adr-tools"

# Communication stuff
cask "microsoft-teams"
cask "slack"
cask "zoom"

# Security stuff
cask "1password"
cask "oversight"

# Browser stuff
cask "browserstacklocal"
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Terminal stuff
brew "direnv"
brew "starship"
cask "iterm2"

# Programming stuff
cask "visual-studio-code"
